HirokiIshiguro/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/serial_terminal_task.c
                                            sci_buffer[current_buffer_pointer] = 0;
                                            /* +1 means '\0' as a string terminator */
                                            if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)target, strlen(target), (uint8_t *)sci_buffer, strlen((const char *)sci_buffer) + 1))
                                            {
                                                sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                            }
                                            else
                                            {
                                                sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                            }
                                            break;
                                        }
                                        if((strstr(sci_buffer, "quit")) || (strstr(sci_buffer, "exit")))
                                        {
                                            break;
                                        }
                                        if(current_buffer_pointer == SCI_BUFFER_SIZE)
                                        {
                                            memset(sci_buffer, 0, SCI_BUFFER_SIZE);
                                            current_buffer_pointer = 0;
                                        }
                                    }
                                }
                                else if((!strcmp((const char *)arg3, "mqttbrokerendpoint")))
                                {
                                    /* +1 means '\0' as a string terminator */
                                    if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)mqtt_broker_endpoint_label, strlen(mqtt_broker_endpoint_label), (uint8_t *)arg4, strlen((const char *)arg4) + 1))
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                    else
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                }
                                else if((!strcmp((const char *)arg3, "iotthingname")))
                                {
                                    /* +1 means '\0' as a string terminator */
                                    if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)iot_thing_name_label, strlen(iot_thing_name_label), (uint8_t *)arg4, strlen((const char *)arg4) + 1))
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                    else
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                }
                                else if((!strcmp((const char *)arg3, "macaddress")))
                                {
                                    /* +1 means '\0' as a string terminator */
                                    if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)mac_address_label, strlen(mac_address_label), (uint8_t *)arg4, strlen((const char *)arg4) + 1))
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                    else
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                }
                                else
                                {
                                    sprintf(message_buffer, "unknown argument3 = %s.\n", arg3);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tcpsendperformanceserveripaddress")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tcp_send_performance_server_ip_address_label, strlen(tcp_send_performance_server_ip_address_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tcpsendperformanceserverportnumber")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tcp_send_performance_server_port_number_label, strlen(tcp_send_performance_server_port_number_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tracealyzerserveripaddress")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tracealyzer_server_ip_address_label, strlen(tracealyzer_server_ip_address_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tracealyzerserverportnumber")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tracealyzer_server_port_number_label, strlen(tracealyzer_server_port_number_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else
                            {
                                sprintf(message_buffer, "unknown argument2 = %s.\n", arg2);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                        }
                        else if(!strcmp((const char *)arg1, "read"))
                        {
                            R_SFD_ResetScan();
                            while(1)
                            {
                                if(SFD_SUCCESS == R_SFD_Scan(&label, &label_length, &data, &data_length))
                                {
                                    sprintf(message_buffer, "label = ");
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    memcpy(message_buffer, label, label_length);
                                    message_buffer[label_length] = 0;
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "\n");
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "data = ");
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    memcpy(message_buffer, data, data_length);
                                    message_buffer[data_length] = 0;
                                    for(int i = 0; i < strlen(message_buffer); i++)
                                    {
                                        if((message_buffer[i] < 0x20) || (message_buffer[i] > 0x7e))
                                        {
                                            if((message_buffer[i] != 0x0a) && (message_buffer[i] != 0x0d))
                                            {
                                                strcpy(message_buffer, "Could not print: <binary data> is included.");
                                                message_buffer[strlen(message_buffer)] = 0;
                                                break;
                                            }
                                        }
                                    }
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    vTaskDelay(100); /* 長い文字列をSCI(UART)出力した際に最後のほうが出力されない。完了待ちの方法が不明なためとりあえず時間待ち */
                                    sprintf(message_buffer, "\n");
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "data_length(includes string terminator 1byte zero) = %d", data_length);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "\n\n");
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    break;
                                }
                            }
                        }
                        else if(!strcmp((const char *)arg1, "erase"))
                        {
                            R_SFD_EraseAll();
                            sprintf(message_buffer, "completed erasing all flash.\n");
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        else
                        {
                            sprintf(message_buffer, "unknown argument1 = %s.\n", arg1);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        break;
                    case COMMAND_TOUCH:
                    {
                        int touch_x, touch_y;
                        if(!strcmp((const char *)arg1, "any"))
                        {
                            touch_x = 240;
                            touch_y = 136;
                        }
                        else
                        {
                            touch_x = atoi((const char *)arg1);
                            touch_y = atoi((const char *)arg2);
                        }
                        if(touch_x < 0 || touch_x >= 480 || touch_y < 0 || touch_y >= 272)
                        {
                            sprintf(message_buffer, "touch: invalid coordinates (%d, %d)\n", touch_x, touch_y);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        else
                        {
                            GUI_PID_STATE pid_state = {0};
                            pid_state.Layer = 0;
                            pid_state.x = touch_x;
                            pid_state.y = touch_y;
                            pid_state.Pressed = 1;
                            GUI_TOUCH_StoreStateEx(&pid_state);
                            vTaskDelay(50);
                            pid_state.Pressed = 0;
                            GUI_TOUCH_StoreStateEx(&pid_state);
                            vTaskDelay(50);
                            sprintf(message_buffer, "touch (%d, %d) OK\n", touch_x, touch_y);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        break;
                    }
                    case COMMAND_SDCARD:
                    {
                        if(!strcmp((const char *)arg1, "list"))
                        {
                            DIR sd_dir;
                            FILINFO sd_fno;
                            FRESULT sd_ret;

                            sd_ret = R_tfat_f_opendir(&sd_dir, "0:");
                            if(sd_ret == TFAT_FR_OK)
                            {
                                while(1)
                                {
                                    sd_ret = R_tfat_f_readdir(&sd_dir, &sd_fno);
                                    if(sd_ret != TFAT_FR_OK || sd_fno.fname[0] == '\0')
                                    {
                                        break;
                                    }
                                    if(TFAT_AM_DIR == (sd_fno.fattrib & TFAT_AM_DIR))
                                    {
                                        continue;
                                    }
                                    sprintf(message_buffer, "%s %lu\r\n", sd_fno.fname, (unsigned long)sd_fno.fsize);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    vTaskDelay(1);
                                }
                            }
                            else
                            {
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "ERROR: SD card not ready\r\n");
                            }
                        }
                        else if(!strcmp((const char *)arg1, "write"))
                        {
                            /* sdcard write <filename> <size>
                             * Binary transfer protocol:
                             *   Host -> MCU: sdcard write <filename> <size>\r\n
                             *   MCU -> Host: READY <chunk_size>\r\n
                             *   [Loop:]
                             *     Host -> MCU: [raw binary, chunk_size bytes]
                             *     MCU -> Host: W <received_total>\r\n
                             *   MCU -> Host: DONE <received_total>\r\n
                             */
                            char filepath[270];
                            uint32_t file_size;
                            FIL sd_file;
                            FRESULT sd_ret;
                            uint32_t chunk_size;
                            uint32_t received_total;
                            uint32_t remaining;
                            uint32_t expected;
                            uint32_t bytes_in_chunk;
                            uint16_t bytes_written;
                            int write_error;

