HirokiIshiguro/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/serial_terminal_task.c
                            file_size = strtoul((const char *)arg3, NULL, 10);
                            if(file_size == 0)
                            {
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "ERROR: invalid size\r\n");
                                break;
                            }

                            sprintf(filepath, "0:%s", (char *)arg2);
                            sd_ret = R_tfat_f_open(&sd_file, filepath, TFAT_FA_CREATE_ALWAYS | TFAT_FA_WRITE);
                            if(sd_ret != TFAT_FR_OK)
                            {
                                sprintf(message_buffer, "ERROR: Cannot open %s (err=%d)\r\n", (char *)arg2, sd_ret);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                break;
                            }

                            chunk_size = SCI_BUFFER_SIZE;
                            sprintf(message_buffer, "READY %lu\r\n", (unsigned long)chunk_size);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);

                            received_total = 0;
                            write_error = 0;

                            while(received_total < file_size)
                            {
                                remaining = file_size - received_total;
                                expected = (remaining < chunk_size) ? remaining : chunk_size;
                                bytes_in_chunk = 0;

                                /* Receive binary data without echo */
                                while(bytes_in_chunk < expected)
                                {
                                    xQueueReceive(xSerialTermQueue, &tmp, portMAX_DELAY);
                                    sci_buffer[bytes_in_chunk++] = tmp[0];
                                }

                                /* Write chunk to SD card */
                                sd_ret = R_tfat_f_write(&sd_file, sci_buffer, (uint16_t)bytes_in_chunk, &bytes_written);
                                if(sd_ret != TFAT_FR_OK || bytes_written != (uint16_t)bytes_in_chunk)
                                {
                                    sprintf(message_buffer, "ERROR: Write failed at %lu (err=%d)\r\n", (unsigned long)received_total, sd_ret);
                                    serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    write_error = 1;
                                    break;
                                }

                                R_tfat_f_sync(&sd_file);
                                received_total += bytes_in_chunk;

                                /* Send ACK with progress */
                                sprintf(message_buffer, "W %lu\r\n", (unsigned long)received_total);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }

                            R_tfat_f_close(&sd_file);

                            if(!write_error && received_total == file_size)
                            {
                                sprintf(message_buffer, "DONE %lu\r\n", (unsigned long)received_total);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                            else
                            {
                                /* Cleanup incomplete file */
                                R_tfat_f_unlink(filepath);
                            }
                        }
                        else if(!strcmp((const char *)arg1, "delete"))
                        {
                            char filepath[270];
                            FRESULT sd_ret;

                            sprintf(filepath, "0:%s", (char *)arg2);
                            sd_ret = R_tfat_f_unlink(filepath);
                            if(sd_ret == TFAT_FR_OK)
                            {
                                sprintf(message_buffer, "deleted %s\r\n", (char *)arg2);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                            else
                            {
                                sprintf(message_buffer, "ERROR: Cannot delete %s (err=%d)\r\n", (char *)arg2, sd_ret);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                        }
                        else if(!strcmp((const char *)arg1, "rescan"))
                        {
                            /* Force the FW Update LISTBOX to re-scan SD card files.
                             * Needed after sdcard write because sdcard_task only scans
                             * on SD card attach events (physical insertion). */
                            firmware_update_update_file_search(task_info);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "rescan OK\r\n");
                        }
                        else if(!strcmp((const char *)arg1, "update"))
                        {
                            /* sdcard update <filename>
                             * Directly trigger firmware update without GUI interaction.
                             * Calls firmware_update_request() which is the same function
                             * that the FW Update BUTTON_03 (START) callback uses.
                             * The sdcard_task loop will process the update, and after
                             * completion will set software_reset_requested_flag to trigger
                             * a software reset. */
                            if(arg2[0] == '\0')
                            {
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "usage: sdcard update <filename>\r\n");
                            }
                            else if(true == is_firmware_updating())
                            {
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "ERROR: firmware update already in progress\r\n");
                            }
                            else
                            {
                                firmware_update_request((char *)arg2);
                                sprintf(message_buffer, "firmware update started: %s\r\n", (char *)arg2);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                        }
                        else if(!strcmp((const char *)arg1, "status"))
                        {
                            /* sdcard status
                             * Report LISTBOX state for debugging GUI touch issues.
                             * Returns number of items and current selection index. */
                            int num_items = firmware_update_listbox_get_num_items(task_info);
                            int sel = firmware_update_listbox_get_sel(task_info);
                            sprintf(message_buffer, "listbox items=%d sel=%d\r\n", num_items, sel);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        else if(!strcmp((const char *)arg1, "select"))
                        {
                            /* sdcard select <index>
                             * Programmatically select a LISTBOX item by index.
                             * Equivalent to touching the item in the LISTBOX. */
                            int sel_index = atoi((const char *)arg2);
                            int num_items = firmware_update_listbox_get_num_items(task_info);
                            if(sel_index < 0 || sel_index >= num_items)
                            {
                                sprintf(message_buffer, "ERROR: index %d out of range (0..%d)\r\n", sel_index, num_items - 1);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                            else
                            {
                                firmware_update_listbox_set_sel(task_info, sel_index);
                                sprintf(message_buffer, "selected %d\r\n", sel_index);
                                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                        }
                        else
                        {
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "usage: sdcard list|write|delete|rescan|update|status|select\r\n");
                        }
                        break;
                    }
                    case COMMAND_NETWORK:
                    {
                        if(!strcmp((const char *)arg1, "info"))
                        {
                            uint32_t ulIPAddress, ulNetMask, ulGatewayAddress, ulDNSServerAddress;
                            char cBuffer[16];

