HirokiIshiguro/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/serial_terminal_task.c
                            FreeRTOS_GetAddressConfiguration(
                                &ulIPAddress,
                                &ulNetMask,
                                &ulGatewayAddress,
                                &ulDNSServerAddress );

                            FreeRTOS_inet_ntoa( ulIPAddress, cBuffer );
                            sprintf(message_buffer, "IP Address: %s\r\n", cBuffer);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);

                            FreeRTOS_inet_ntoa( ulNetMask, cBuffer );
                            sprintf(message_buffer, "Subnet Mask: %s\r\n", cBuffer);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);

                            FreeRTOS_inet_ntoa( ulGatewayAddress, cBuffer );
                            sprintf(message_buffer, "Gateway Address: %s\r\n", cBuffer);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);

                            FreeRTOS_inet_ntoa( ulDNSServerAddress, cBuffer );
                            sprintf(message_buffer, "DNS Server Address: %s\r\n", cBuffer);
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        else if(!strcmp((const char *)arg1, "resolve"))
                        {
                            uint32_t ulResolvedAddress;
                            char cBuffer[16];

                            ulResolvedAddress = FreeRTOS_gethostbyname((const char *)arg2);

                            if( ulResolvedAddress != 0 )
                            {
                                FreeRTOS_inet_ntoa( ulResolvedAddress, cBuffer );
                                sprintf(message_buffer, "Resolved %s as %s\r\n", arg2, cBuffer);
                            }
                            else
                            {
                                sprintf(message_buffer, "DNS resolution failed: %s\r\n", arg2);
                            }
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        else if(!strcmp((const char *)arg1, "setdns"))
                        {
                            uint32_t ulIPAddress, ulNetMask, ulGatewayAddress, ulDNSServerAddress;
                            char cBuffer[16];

                            ulDNSServerAddress = FreeRTOS_inet_addr((const char *)arg2);

                            if( ulDNSServerAddress != 0 )
                            {
                                FreeRTOS_GetAddressConfiguration(
                                    &ulIPAddress,
                                    &ulNetMask,
                                    &ulGatewayAddress,
                                    NULL );

                                FreeRTOS_SetAddressConfiguration(
                                    &ulIPAddress,
                                    &ulNetMask,
                                    &ulGatewayAddress,
                                    &ulDNSServerAddress );

                                FreeRTOS_inet_ntoa( ulDNSServerAddress, cBuffer );
                                sprintf(message_buffer, "DNS Server Address updated to %s\r\n", cBuffer);
                            }
                            else
                            {
                                sprintf(message_buffer, "invalid IP address: %s\r\n", arg2);
                            }
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        else
                        {
                            serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "usage: network info | network resolve <host> | network setdns <ip>\r\n");
                        }
                        break;
                    }
                    case COMMAND_LOG:
                    {
                        /* SCI7 一本化: ログモードに復帰 */
                        extern volatile int32_t serial_mode;
                        serial_mode = SERIAL_MODE_LOG;
                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, "Returning to log mode.\r\n");
                        break;
                    }
                    default:
                        serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, COMMAND_NOT_FOUND);
                        break;
                }
                serial_terminal_putstring(task_info->hWin_serial_terminal, sci_handle, PROMPT);
            }
            else
            {

            }
            current_buffer_pointer = 0;
            memset(sci_buffer, 0, SCI_BUFFER_SIZE);
            memset(command, 0, COMMAND_SIZE);
            memset(arg1, 0, ARGUMENT1_SIZE);
            memset(arg2, 0, ARGUMENT2_SIZE);
            memset(arg3, 0, ARGUMENT3_SIZE);
            memset(arg4, 0, ARGUMENT4_SIZE);
            memset(message_buffer, 0, MESSAGE_BUFFER_SIZE);
        }
        else if(current_buffer_pointer == SCI_BUFFER_SIZE)
        {
            memset(sci_buffer, 0, SCI_BUFFER_SIZE);
            current_buffer_pointer = 0;
        }
    }
}

static int32_t get_command_code(uint8_t *command)
{
    int32_t return_code;

    if(!strcmp((char*)command, "freertos"))
    {
        return_code = COMMAND_FREERTOS;
    }
    else if(!strcmp((char*)command, "version"))
    {
        return_code = COMMAND_VERSION;
    }
    else if(!strcmp((char*)command, "timezone"))
    {
        return_code = COMMAND_TIMEZONE;
    }
    else if(!strcmp((char*)command, "reset"))
    {
        return_code = COMMAND_RESET;
    }
    else if(!strcmp((char*)command, "dataflash"))
    {
        return_code = COMMAND_DATAFLASH;
    }
    else if(!strcmp((char*)command, "touch"))
    {
        return_code = COMMAND_TOUCH;
    }
    else if(!strcmp((char*)command, "sdcard"))
    {
        return_code = COMMAND_SDCARD;
    }
    else if(!strcmp((char*)command, "network"))
    {
        return_code = COMMAND_NETWORK;
    }
    else if(!strcmp((char*)command, "log"))
    {
        return_code = COMMAND_LOG;
    }
    else
    {
        return_code = COMMAND_UNKNOWN;
    }
    return return_code;
}

static void serial_terminal_putstring(WM_HWIN hWin_handle, sci_hdl_t sci_handle, char *string)
{
    uint16_t str_length = 0;
    volatile uint16_t transmit_length = 0;
    sci_err_t sci_err;
    uint32_t retry = 0xFFFF;

    str_length = (uint16_t)strlen(string);

    while ((retry > 0) && (str_length > 0))
    {
        R_SCI_Control(sci_handle, SCI_CMD_TX_Q_BYTES_FREE, (void *)&transmit_length);

        if(transmit_length > str_length)
        {
            transmit_length = str_length;
        }

        sci_err = R_SCI_Send(sci_handle, (uint8_t *) string,
                             transmit_length);

        if ((sci_err == SCI_ERR_XCVR_BUSY) || (sci_err == SCI_ERR_INSUFFICIENT_SPACE))
        {
            retry--; // retry if previous transmission still in progress or tx buffer is insufficient.
            continue;
        }

        str_length -= transmit_length;
        string += transmit_length;

        xSemaphoreTake(xSerialTermTxSemaphore, portMAX_DELAY);

    }

    if (SCI_SUCCESS != sci_err)
    {
        R_BSP_NOP(); //TODO error handling code
    }

}

/* SCI7 一本化: SCI2 の callback は不要。RX/TX イベントは
 * serial_term_uart.c の my_sci_callback() で処理される。 */
static void sci_callback(void *pArgs)
{
    (void)pArgs;
}

void vConfigureTimerForRunTimeStats(void)
{
    uint32_t channel;
    /* 10us tick timer start */
    R_CMT_CreatePeriodic(100000, _10us_timer_tick, &channel);
}

uint32_t ulGetRunTimeCounterValue(void)
{
    return _10us_timer_count;
}

void _10us_timer_tick(void *arg)
{
    _10us_timer_count++;
}
